23-views-and-forms/cars/app/controllers/cars_controller.rb

SELECT "cars".* FROM "cars"
---
  def index
    @cars = Car.all

INSERT INTO "cars" ("make", "model", "wheels", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["make", "Honda"], ["model", "Civic"], ["wheels", 5], ["created_at", "2018-04-13 15:29:43.216333"], ["updated_at", "2018-04-13 15:29:43.216333"]]
---
  def create
    # actually creates the car using info from user
    car = Car.new

    car.make = params[:car][:make]
    car.model = params[:car][:model]
    car.wheels = params[:car][:wheels]

    car.save

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    # shows a form to edit a car
    @car = Car.find(params[:id])